# etf_industry_map.py

# 这个字典的键应该是ak.stock_sector_fund_flow_rank返回的板块名称，
# 值是对应的ETF代码。你需要根据实际情况填充。
# 板块名称可能需要从AkShare实际获取的数据中确认。
ETF_INDUSTRY_MAPPINGS = {
            '半导体':'512480', #半导体ETF
            '电机':'562500', # 机器人ETF
            '软件开发':'159852', # 软件ETF
            '电池':'159755', # 电池ETF
            '有色金属':'512400', # 有色金属ETF
            '互联网服务':'513050', # 中概互联网ETF
            '计算机设备':'159998', # 计算机ETF
            '通信设备':'159695', # 通信ETF
            '贵金属':'517520',  # 黄金股ETF, 黄金ETF-518880
            '证券':'512880',    # 证券ETF
            '保险':'512070',    # 证券保险ETF
            '多元金融':'159851', # 金融科技ETF
            '银行':'512800',    # 银行ETF
            '煤炭':'515220',    # 煤炭ETF
            '电力行业':'159611', # 电力ETF
            '农牧饲渔':'516670', # 畜牧养殖ETF
            '工程建设':'516970', # 基建50ETF
            '房地产开发':'512200', # 房地产ETF
            '食品饮料':'159736', # 食品饮料ETF天弘, 
            '酿酒行业':'512690', # 酒ETF
            '游戏':'159869',     # 游戏ETF
            '文化传媒':'512980', # 传媒ETF
            '家电行业':'159996', # 家电ETF
            '电子元件':'159997', # 电子ETF, 
            '消费电子':'159732', # 消费电子ETF
            '光伏设备':'515790', # 光伏ETF
            '生物制品':'159837', # 生物科技ETF, 生物医药ETF-512290
            '医疗器械':'159883', # 医疗器械ETF
            '中药':'560080',     # 中药ETF
}

ETF_SELECT_MAPPINGS = {
    '沪深300ETF': '510300',
    '上证50ETF': '510050',
    '中证500ETF': '510500',
    '创业板ETF': '159915',
    '科创50ETF': '588000',
    '中证1000ETF': '512100',
    '黄金ETF': '518880',
    '港股通互联网ETF': '159792',
    '证券ETF': '512880',
    '恒生科技指数ETF': '513180',
    '芯片ETF': '159995',
    '医疗ETF': '512170',
    '纳指ETF': '159941',
    '标普500ETF': '513500',
    '券商ETF': '512000',
    '半导体ETF': '512480',
    '医药ETF': '512010',
    '红利ETF': '510880',
    '人工智能ETF': '159819',
    '军工ETF': '512660',
    '消费ETF': '159928',
    '机器人ETF': '562500',
    '酒ETF': '512690',
    '港股创新药ETF': '513120',
    '光伏ETF': '515790',
    '银行ETF': '512800',
    '恒生医疗ETF': '513060',
    '证券保险ETF': '512070',
    '游戏ETF': '159869',
    '房地产ETF': '512200',
    '央企改革ETF': '512950',
    '食品饮料ETF天弘': '159736',
    '有色金属ETF': '512400',
    '新能源ETF': '516160',
    '黄金股ETF': '517520',
    '煤炭ETF': '515220',
    '电力ETF': '159611',
    '养殖ETF': '159865',
    '软件ETF': '159852',
    '通信ETF': '515880',
    '传媒ETF': '512980',
    '基建50ETF': '516970',
    '稀土ETF基金': '516150',
    '钢铁ETF': '515210',
    '中药ETF': '560080',
    '德国ETF': '159561',
    '东南亚科技ETF': '513730',
    '日经225ETF': '513880',
    '沙特ETF': '520830',
    '标普油气ETF': '159518'
}

# 也可以提供一个反向映射，如果需要从ETF代码找到行业名称
INDUSTRY_ETF_MAPPINGS_REVERSE = {v: k for k, v in ETF_INDUSTRY_MAPPINGS.items()}

def get_etf_for_industry(industry_name):
    return ETF_INDUSTRY_MAPPINGS.get(industry_name)

def get_industry_for_etf(etf_code):
    return INDUSTRY_ETF_MAPPINGS_REVERSE.get(etf_code)

def get_available_industries_with_etf():
    return list(ETF_INDUSTRY_MAPPINGS.keys())